In [151]:
import pandas as pd

In [152]:
import numpy as np

In [153]:
import matplotlib.pyplot as plt

In [154]:
s = pd.Series([1,3,5,np.nan,6,8])

In [155]:
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [156]:
dates = pd.date_range('20130101', periods=6)

In [157]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [158]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [159]:
df

                   A         B         C         D
2013-01-01 -1.538420  0.901450  1.602756  0.688277
2013-01-02 -1.222423 -0.170225  1.100112 -0.261503
2013-01-03  2.004380  0.053747 -0.182327  2.271176
2013-01-04  0.476284  0.237339 -0.348117 -0.536228
2013-01-05 -0.669300 -0.066122  0.702128  0.852211
2013-01-06  0.654198  0.573876 -1.591514  0.522497

In [160]:
df2 = pd.DataFrame({'A' : 1., 
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D' : np.array([3] * 4, dtype='int32'),
                    'E' : pd.Categorical(["test", "train", "test", "train"]),
                    'F' : 'foo'})

In [161]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [162]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [163]:
df2.<TAB>

SyntaxError: invalid syntax (<ipython-input-163-e8d0e54abc86>, line 1)

In [ ]:
df.head()

In [ ]:
df.tail(3)

In [ ]:
df.index

In [ ]:
df.columns

In [ ]:
df.values

In [ ]:
df.describe()

In [ ]:
df.T

In [ ]:
df.sort_index(axis=1, ascending=False)

In [ ]:
df.sort(columns='B')

In [ ]:
df['A']

In [ ]:
df[0:3]

In [ ]:
df['20130102':'20130104']

In [ ]:
df.loc[dates[0]]

In [164]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.538420  0.901450
2013-01-02 -1.222423 -0.170225
2013-01-03  2.004380  0.053747
2013-01-04  0.476284  0.237339
2013-01-05 -0.669300 -0.066122
2013-01-06  0.654198  0.573876

In [165]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.222423 -0.170225
2013-01-03  2.004380  0.053747
2013-01-04  0.476284  0.237339

In [166]:
df.loc['20130102',['A','B']]

A   -1.222423
B   -0.170225
Name: 2013-01-02 00:00:00, dtype: float64

In [167]:
df.loc[dates[0],'A']

-1.538420216247568

In [168]:
df.at[dates[0], 'A']

-1.538420216247568

In [169]:
df.iloc[3]

A    0.476284
B    0.237339
C   -0.348117
D   -0.536228
Name: 2013-01-04 00:00:00, dtype: float64

In [170]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.476284  0.237339
2013-01-05 -0.669300 -0.066122

In [171]:
df.iloc[[1,2,4,],[0,2]]

                   A         C
2013-01-02 -1.222423  1.100112
2013-01-03  2.004380 -0.182327
2013-01-05 -0.669300  0.702128

In [172]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.222423 -0.170225  1.100112 -0.261503
2013-01-03  2.004380  0.053747 -0.182327  2.271176

In [173]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.901450  1.602756
2013-01-02 -0.170225  1.100112
2013-01-03  0.053747 -0.182327
2013-01-04  0.237339 -0.348117
2013-01-05 -0.066122  0.702128
2013-01-06  0.573876 -1.591514

In [174]:
df.iloc[1,1]

-0.17022543207971555

In [175]:
df.iat[1,1]

-0.17022543207971555

In [176]:
df[df.A > 0]

                   A         B         C         D
2013-01-03  2.004380  0.053747 -0.182327  2.271176
2013-01-04  0.476284  0.237339 -0.348117 -0.536228
2013-01-06  0.654198  0.573876 -1.591514  0.522497

In [177]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.901450  1.602756  0.688277
2013-01-02       NaN       NaN  1.100112       NaN
2013-01-03  2.004380  0.053747       NaN  2.271176
2013-01-04  0.476284  0.237339       NaN       NaN
2013-01-05       NaN       NaN  0.702128  0.852211
2013-01-06  0.654198  0.573876       NaN  0.522497

In [178]:
df2 = df.copy()

In [179]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [180]:
df2

                   A         B         C         D      E
2013-01-01 -1.538420  0.901450  1.602756  0.688277    one
2013-01-02 -1.222423 -0.170225  1.100112 -0.261503    one
2013-01-03  2.004380  0.053747 -0.182327  2.271176    two
2013-01-04  0.476284  0.237339 -0.348117 -0.536228  three
2013-01-05 -0.669300 -0.066122  0.702128  0.852211   four
2013-01-06  0.654198  0.573876 -1.591514  0.522497  three

In [181]:
df2[df2['E'].isin(['two','four'])]

                  A         B         C         D     E
2013-01-03  2.00438  0.053747 -0.182327  2.271176   two
2013-01-05 -0.66930 -0.066122  0.702128  0.852211  four

In [182]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [183]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [184]:
df['F']=s1

In [185]:
df.at[dates[0],'A'] = 0

In [186]:
df.iat[0,1] = 0

In [187]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [188]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  1.602756  5 NaN
2013-01-02 -1.222423 -0.170225  1.100112  5   1
2013-01-03  2.004380  0.053747 -0.182327  5   2
2013-01-04  0.476284  0.237339 -0.348117  5   3
2013-01-05 -0.669300 -0.066122  0.702128  5   4
2013-01-06  0.654198  0.573876 -1.591514  5   5

In [189]:
df2 = df.copy()

In [190]:
df2[df2 > 0] = -df2

In [191]:
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -1.602756 -5 NaN
2013-01-02 -1.222423 -0.170225 -1.100112 -5  -1
2013-01-03 -2.004380 -0.053747 -0.182327 -5  -2
2013-01-04 -0.476284 -0.237339 -0.348117 -5  -3
2013-01-05 -0.669300 -0.066122 -0.702128 -5  -4
2013-01-06 -0.654198 -0.573876 -1.591514 -5  -5

In [192]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [193]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [194]:
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000  1.602756  5 NaN   1
2013-01-02 -1.222423 -0.170225  1.100112  5   1   1
2013-01-03  2.004380  0.053747 -0.182327  5   2 NaN
2013-01-04  0.476284  0.237339 -0.348117  5   3 NaN

In [195]:
df1.dropna(how='any')

                   A         B         C  D  F  E
2013-01-02 -1.222423 -0.170225  1.100112  5  1  1

In [196]:
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000  1.602756  5  5  1
2013-01-02 -1.222423 -0.170225  1.100112  5  1  1
2013-01-03  2.004380  0.053747 -0.182327  5  2  5
2013-01-04  0.476284  0.237339 -0.348117  5  3  5

In [197]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [198]:
df.mean()

A    0.207190
B    0.104769
C    0.213840
D    5.000000
F    3.000000
dtype: float64

In [199]:
df.mean(1)

2013-01-01    1.650689
2013-01-02    1.141493
2013-01-03    1.775160
2013-01-04    1.673101
2013-01-05    1.793341
2013-01-06    1.927312
Freq: D, dtype: float64

In [200]:
s = pd.Series([1,3,5,np.nan,6,9], index=dates).shift(2)

In [201]:
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [202]:
df.sub(s, axis='index')

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02       NaN       NaN       NaN NaN NaN
2013-01-03  1.004380 -0.946253 -1.182327   4   1
2013-01-04 -2.523716 -2.762661 -3.348117   2   0
2013-01-05 -5.669300 -5.066122 -4.297872   0  -1
2013-01-06       NaN       NaN       NaN NaN NaN

In [203]:
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-01  0.000000  0.000000  1.602756   5 NaN
2013-01-02 -1.222423 -0.170225  2.702868  10   1
2013-01-03  0.781957 -0.116479  2.520541  15   3
2013-01-04  1.258241  0.120860  2.172424  20   6
2013-01-05  0.588941  0.054739  2.874553  25  10
2013-01-06  1.243139  0.628615  1.283039  30  15

In [204]:
df.apply(lambda x:x.max() - x.min())

A    3.226804
B    0.744101
C    3.194270
D    0.000000
F    4.000000
dtype: float64

In [205]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [206]:
s

0    6
1    3
2    1
3    0
4    5
5    5
6    6
7    0
8    1
9    3
dtype: int32

In [207]:
s.value_counts()

6    2
5    2
3    2
1    2
0    2
dtype: int64

In [208]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [209]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [210]:
df = pd.DataFrame(np.random.randn(10,4))

In [211]:
df

          0         1         2         3
0  0.669421  0.139527  1.893140 -0.938224
1  0.774394 -1.026656 -2.160853  0.588888
2  0.852581  0.584766  1.354684  1.993955
3  1.298907 -1.212026 -0.439230  0.453479
4  0.635453  0.141629 -0.242690  1.230753
5  0.003337  0.718941  0.828088 -0.440202
6 -1.040333 -1.941527  0.368805  0.885760
7  0.447611 -0.295982  0.381472  0.871669
8 -0.672567 -0.851716 -1.632741 -0.494465
9  1.521003 -0.457420 -1.547336 -0.879610

In [212]:
pieces = [df[:3], df[3:7], df[7:]]

In [213]:
pd.concat(pieces)

          0         1         2         3
0  0.669421  0.139527  1.893140 -0.938224
1  0.774394 -1.026656 -2.160853  0.588888
2  0.852581  0.584766  1.354684  1.993955
3  1.298907 -1.212026 -0.439230  0.453479
4  0.635453  0.141629 -0.242690  1.230753
5  0.003337  0.718941  0.828088 -0.440202
6 -1.040333 -1.941527  0.368805  0.885760
7  0.447611 -0.295982  0.381472  0.871669
8 -0.672567 -0.851716 -1.632741 -0.494465
9  1.521003 -0.457420 -1.547336 -0.879610

In [214]:
left = pd.DataFrame({'key':['foo', 'foo'], 'lval': [1, 2]})

In [215]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval':[4, 5]})

In [216]:
left

   key  lval
0  foo     1
1  foo     2

In [217]:
right

   key  rval
0  foo     4
1  foo     5

In [218]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [219]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [220]:
df

          A         B         C         D
0  1.533200 -0.633877 -0.675680  0.221905
1  0.770513 -1.026314  0.873801  1.190249
2  0.195646 -0.385109 -2.230729 -0.249344
3  0.432167  0.306618 -1.684703  0.859869
4 -0.746872  0.440212 -1.186551 -0.910864
5 -0.890838 -1.176586  0.614303 -0.379665
6  0.184446 -0.014860 -0.976423  1.263704
7 -0.979859 -0.929820 -0.146006  1.622357

In [221]:
s = df.iloc[3]

In [222]:
df.append(s, ignore_index=True)

          A         B         C         D
0  1.533200 -0.633877 -0.675680  0.221905
1  0.770513 -1.026314  0.873801  1.190249
2  0.195646 -0.385109 -2.230729 -0.249344
3  0.432167  0.306618 -1.684703  0.859869
4 -0.746872  0.440212 -1.186551 -0.910864
5 -0.890838 -1.176586  0.614303 -0.379665
6  0.184446 -0.014860 -0.976423  1.263704
7 -0.979859 -0.929820 -0.146006  1.622357
8  0.432167  0.306618 -1.684703  0.859869

In [223]:
df = pd.DataFrame({'A':['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B':['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C':np.random.randn(8),
                   'D':np.random.randn(8)})

In [224]:
df

     A      B         C         D
0  foo    one -0.169951  0.028085
1  bar    one -1.080882 -0.847926
2  foo    two  0.690681 -0.819519
3  bar  three -0.529964 -1.655355
4  foo    two  0.692799 -0.594318
5  bar    two -0.494289 -0.471555
6  foo    one -0.572390 -1.731595
7  foo  three  0.991308 -0.931957

In [225]:
df.groupby('A').sum()

            C         D
A
bar -2.105135 -2.974836
foo  1.632448 -4.049304

In [226]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -1.080882 -0.847926
    three -0.529964 -1.655355
    two   -0.494289 -0.471555
foo one   -0.742341 -1.703511
    three  0.991308 -0.931957
    two    1.383480 -1.413837

In [227]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))

In [228]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [229]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [230]:
df2 = df[:4]

In [231]:
df2

                     A         B
first second
bar   one    -0.341359  1.272611
      two    -0.870299  0.648129
baz   one     0.213007 -0.211991
      two    -1.666329  1.712798

In [232]:
stacked = df2.stack()

In [233]:
stacked

first  second
bar    one     A   -0.341359
               B    1.272611
       two     A   -0.870299
               B    0.648129
baz    one     A    0.213007
               B   -0.211991
       two     A   -1.666329
               B    1.712798
dtype: float64

In [234]:
stacked.unstack()

                     A         B
first second
bar   one    -0.341359  1.272611
      two    -0.870299  0.648129
baz   one     0.213007 -0.211991
      two    -1.666329  1.712798

In [235]:
stacked.unstack(1)

second        one       two
first
bar   A -0.341359 -0.870299
      B  1.272611  0.648129
baz   A  0.213007 -1.666329
      B -0.211991  1.712798

In [236]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.341359  0.213007
       B  1.272611 -0.211991
two    A -0.870299 -1.666329
       B  0.648129  1.712798

In [237]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})

In [238]:
df

        A  B    C         D         E
0     one  A  foo  0.604862  0.461135
1     one  B  foo  0.991352  0.298496
2     two  C  foo  1.374219  0.526852
3   three  A  bar -0.121348 -1.309338
4     one  B  bar -0.532425  1.325152
5     one  C  bar  1.060572  0.201391
6     two  A  foo -0.539284  1.005718
7   three  B  foo  0.837174 -0.461950
8     one  C  foo -0.763302  0.080180
9     one  A  bar -0.105276  1.480363
10    two  B  bar  0.661664  0.581071
11  three  C  bar -0.222213  1.039002

In [239]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.105276  0.604862
      B -0.532425  0.991352
      C  1.060572 -0.763302
three A -0.121348       NaN
      B       NaN  0.837174
      C -0.222213       NaN
two   A       NaN -0.539284
      B  0.661664       NaN
      C       NaN  1.374219

In [240]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [241]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [242]:
ts.resample('5Min', how='sum')

2012-01-01    24958
Freq: 5T, dtype: int32

In [243]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [244]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [245]:
ts

2012-03-06    1.241190
2012-03-07   -0.440093
2012-03-08    0.497535
2012-03-09    0.708529
2012-03-10   -1.236365
Freq: D, dtype: float64

In [246]:
ts_utc = ts.tz_localize('UTC')

In [247]:
ts_utc

2012-03-06 00:00:00+00:00    1.241190
2012-03-07 00:00:00+00:00   -0.440093
2012-03-08 00:00:00+00:00    0.497535
2012-03-09 00:00:00+00:00    0.708529
2012-03-10 00:00:00+00:00   -1.236365
Freq: D, dtype: float64

In [248]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    1.241190
2012-03-06 19:00:00-05:00   -0.440093
2012-03-07 19:00:00-05:00    0.497535
2012-03-08 19:00:00-05:00    0.708529
2012-03-09 19:00:00-05:00   -1.236365
Freq: D, dtype: float64

In [249]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [250]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [251]:
ts

2012-01-31   -1.288025
2012-02-29    0.960880
2012-03-31    2.198665
2012-04-30   -0.221824
2012-05-31    1.066390
Freq: M, dtype: float64

In [252]:
ps = ts.to_period()

In [253]:
ps

2012-01   -1.288025
2012-02    0.960880
2012-03    2.198665
2012-04   -0.221824
2012-05    1.066390
Freq: M, dtype: float64

In [254]:
ps.to_timestamp()

2012-01-01   -1.288025
2012-02-01    0.960880
2012-03-01    2.198665
2012-04-01   -0.221824
2012-05-01    1.066390
Freq: MS, dtype: float64

In [255]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [256]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [257]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [258]:
ts.head()

1990-03-01 09:00    0.540016
1990-06-01 09:00    1.105231
1990-09-01 09:00    1.013246
1990-12-01 09:00   -0.468293
1991-03-01 09:00   -0.138551
Freq: H, dtype: float64

In [259]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [260]:
df["grade"] = df["raw_grade"].astype("category")

In [261]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [262]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [263]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [264]:
df["grade"]=df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [265]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [266]:
df.sort("grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [267]:
df.groupby("grade").size()

grade
very bad      1
bad         NaN
medium      NaN
good          2
very good     3
dtype: float64

In [268]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))

In [269]:
ts = ts.cumsum()

In [270]:
ts.plot()

In [271]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index, columns=['A', 'B', 'C', 'D'])

In [272]:
df = df.cumsum()

In [273]:
plt.figure();df.plot();plt.legend(loc='best')

In [274]:
df.to_csv('foo.csv')

In [275]:
pd.read_csv('foo.csv')

     Unnamed: 0          A         B          C          D
0    2000-01-01  -1.922357 -2.095080   1.489114   0.343424
1    2000-01-02  -1.991462 -1.960733  -0.083439  -0.768962
2    2000-01-03  -0.155093 -0.246421  -0.614723  -1.814092
3    2000-01-04  -0.446375 -0.597243  -0.900545  -0.858562
4    2000-01-05   0.670864 -0.307788  -2.565853  -0.958080
5    2000-01-06   0.396645  0.425442  -3.907305  -0.249584
6    2000-01-07   0.276740 -0.315032  -1.711506  -1.594218
7    2000-01-08  -1.815369 -0.277667  -3.073777  -1.092438
8    2000-01-09   0.384738  1.301741  -2.692903   0.411209
9    2000-01-10  -1.597130  2.152501  -2.200004  -1.959385
10   2000-01-11  -1.605679  2.902204  -0.371138  -2.443458
11   2000-01-12  -0.943584  3.112148   1.413432  -1.543749
12   2000-01-13  -1.741926  2.122416   2.532192  -1.081255
13   2000-01-14  -0.304746  0.169714   2.704978  -2.330131
14   2000-01-15   0.264072 -1.119771   2.523907  -2.835044
15   2000-01-16   1.377878 -0.427391   2.755425  -2.930190
16   2000-01-17   0.417814 -0.825358   2.984387  -4.450204
17   2000-01-18  -0.529993 -1.553255   3.098392  -4.968850
18   2000-01-19  -1.416124 -2.325053   3.863427  -7.124279
19   2000-01-20  -1.498493 -1.901439   6.347352  -6.148712
20   2000-01-21  -1.016203 -0.683932   5.523569  -6.495105
21   2000-01-22  -1.118841 -0.254936   6.644474  -6.798745
22   2000-01-23  -1.689060 -0.802571   5.563584  -5.618469
23   2000-01-24  -1.319111 -1.744181   3.565743  -3.675726
24   2000-01-25  -1.434546 -2.424866   2.564203  -2.751925
25   2000-01-26  -1.321375 -0.187870   2.507273  -1.326497
26   2000-01-27  -0.181969 -0.796720   2.939160   0.724619
27   2000-01-28   1.056131 -0.946083   2.497570  -1.694401
28   2000-01-29   2.207062  0.654606   1.564305  -2.394496
29   2000-01-30   2.234653  0.168971   1.015431  -3.128141
..          ...        ...       ...        ...        ...
970  2002-08-28 -21.734718 -7.795203   8.292804  56.244932
971  2002-08-29 -22.748425 -7.948431   8.951729  57.964855
972  2002-08-30 -23.365624 -8.537563   8.027245  57.185865
973  2002-08-31 -22.792054 -9.461613  10.223604  56.536844
974  2002-09-01 -23.061537 -9.327945   9.239220  55.002666
975  2002-09-02 -21.980636 -8.634956   8.466534  54.422588
976  2002-09-03 -20.793244 -9.267240   8.735269  54.067291
977  2002-09-04 -20.388944 -9.736498   8.171720  53.282872
978  2002-09-05 -21.187236 -8.022687   8.756250  52.829256
979  2002-09-06 -20.678436 -8.385071   9.682957  52.719063
980  2002-09-07 -22.110713 -8.278797  10.363615  52.011436
981  2002-09-08 -22.331544 -7.841954  10.785864  51.882830
982  2002-09-09 -21.876312 -7.091198  11.241748  50.138212
983  2002-09-10 -20.055180 -6.775955  10.416865  48.609985
984  2002-09-11 -20.871915 -6.568420   9.286076  49.112669
985  2002-09-12 -21.296654 -9.048400   7.187527  48.315664
986  2002-09-13 -20.714664 -8.413010   7.053402  48.177258
987  2002-09-14 -19.555699 -7.253516   6.522441  49.021971
988  2002-09-15 -20.897959 -8.605802   5.394913  49.262185
989  2002-09-16 -18.654742 -8.698974   7.326612  48.835118
990  2002-09-17 -18.113073 -8.699565   8.888640  49.870253
991  2002-09-18 -17.451259 -8.404726   9.722640  49.092908
992  2002-09-19 -17.873814 -8.924734   9.002543  48.597148
993  2002-09-20 -19.778923 -8.571472  11.401123  49.580332
994  2002-09-21 -19.964208 -7.483873  12.591169  50.813312
995  2002-09-22 -19.593714 -7.275015  13.740882  51.930741
996  2002-09-23 -19.522715 -5.987093  12.552417  51.588465
997  2002-09-24 -19.603762 -5.085266  14.670841  52.173323
998  2002-09-25 -20.678178 -5.544269  15.468835  52.929691
999  2002-09-26 -21.963717 -4.618379  15.829595  52.087334

[1000 rows x 5 columns]

In [276]:
df.to_hdf('foo.h5','df')

ImportError: HDFStore requires PyTables, "No module named tables" problem importing

In [ ]:
pd.read_hdf('foo.h5', 'df')

In [ ]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

In [ ]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

In [ ]:
if pd.Series([False, True, False]):
    print("I was true")
    Traceback